package ru.geekbrains.main.site.at.collection;

/**
 * V 1. Создать массив с набором из 10–20 слов, должны встречаться повторяющиеся. Найти и вывести список уникальных слов,
 * из которых состоит массив. Посчитать, сколько раз встречается каждое слово.
 *
 * 2. Написать простой класс Телефонный Справочник, который хранит список фамилий и телефонных номеров.
 * В него с помощью метода add() можно добавлять записи, а с помощью get() — искать номер телефона по фамилии.
 * Для одной фамилии может быть несколько телефонов (однофамильцы): тогда при запросе такой фамилии должны выводиться все номера.
 * Не надо в телефонную запись добавлять дополнительные поля (имя, отчество, адрес), делать взаимодействие с пользователем через консоль
 * и иначе дополнять задание. Консоль желательно не использовать для ввода, тестировать просто из метода main(), прописывая add() и get().
 */


public class Phonebook {
}
